
token = '442884388:AAH2-8WiuYM_EvjfH0jnrRVQHPQZgnm3tqM'
helps = """Смари я чааайк-чрезвычааааайка.
Могу отправлять фоточки чаек
Или звуки чаек
А ещё стикеросы с чайками
Или переворачивать твои слова"""
starts = """Так-с , возможно я тебе буду отправлять погоду
Или просто классные пикчи
Но пока я просто учусь"""
settings = """Тут особо нечего настраивать("""
cho = ["чо", "чё", "че", "Чо", "Чё", "Че"]
ooo = ["ООО", "ооо", "оооо", "ОООО", "Ооо", "Оооо", "OOO", "ooo", "Ooo"]
hello = ["Здрасте","Здрасьте","здрасте","здрасьте",""]





