# Данная программа считает значения суммы ряда
# Рисует таблицу с номером операции, исходным X,
# X текущим и текущей суммой
# Определяет, сходится ли ряд к заданной точности Eps или
# Тихомиров

# x - начальное значение
# k - максимальное количество шагов
# step - шаг функции
# eps - точность эпсилон
# y, x - значение функции
# sum - сумма
# i - счетчик
# flag - флаг

from math import factorial

x = float(input('Введите начальное значение '))
k = int(input('Введите максимальное количество шагов '))
step = int(input('Введите шаг '))
eps = float(input('Введите точно Eps '))
y = [0]*(k + 2)
y[0] = x
y[1] = - x ** 3 / 6
sum = y[0]
i = 0
flag = True

print('\u250C', 6 * '\u2500', '\u252C', 11 * '\u2500', '\u252C', 18 * '\u2500',
      '\u252C', 17 * '\u2500', '\u2510', sep='')
print('\u2502', '  ', 'N  ', '\u2502', 4 * ' ', 'X', 5 * ' ', '\u2502', 4 * ' ', 'Xтек', 7 * ' ',
      '\u2502', ' ' * 3, 'Sum ', 7 * ' ', '\u2502', sep='')
print('\u251C', 6 * '\u2500', '\u253C', 11 * '\u2500', '\u253C', 18 * '\u2500',
       '\u253C', 16 * '\u2500', '\u2524', sep='')

print('\u2502', '{:3d}'.format(i), '\u2502', '{:8.2f}'.format(x), '\u2502',
      '{:13.5f}'.format(y[i]),  '\u2502', '{:12.5f}'.format(sum), '\u2502')

while abs(y[i + 1] - y[i]) > eps:
    if i < k:
        i += step
        i2 = 2 * i + 1
        y[i] = ((- 1) ** i) * x ** i2 / factorial(i2)
        sum += y[i]
        print('\u2502', '{:3d}'.format(i), '\u2502', '{:8.2f}'.format(x), '\u2502',
              '{:13.5f}'.format(y[i]),  '\u2502', '{:12.5f}'.format(sum), '\u2502')
    else:
        flag = False
        break

print('\u2514', 6 * '\u2500', '\u2534', 11 * '\u2500', '\u2534', 18 * '\u2500',
      '\u2534', 16 * '\u2500', '\u2518', sep='')

if flag:
    print('Ряд сходится к точности', eps, 'за', i + 1, 'операций')
    print('Сумма ряда равна', '{:4.5f}'.format(sum))
else:
    print('Ряд не сходится к точности', eps, 'за', i, 'операций')


