#                       Тихомиров Дмитрий
text = ['Князь Андрей находился во время сражения при убитом в этом деле ',
        'австрийском генерале Шмите. Под ним была ранена лошадь, ',
        'и сам он был слегка оцарапан в руку пулей. В знак ',
        ' особой милости главнокомандующего он был послан с ',
        'известием об этой победе к австрийскому двору, находившемуся ',
        'уже не в Вене, которой угрожали французские войска, а в Брюнне.  ',
        'Мама папа бабуля.']
a = input('Введите слово, которое надо заменить ')
